Revit 2024 API
FormatOptions.CanSuppressTrailingZeros Method
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanSuppressTrailingZeros()
Visual Basic
Public Function CanSuppressTrailingZeros As Boolean
Visual C++
public:
bool CanSuppressTrailingZeros()
Return Value
 True if trailing zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
CanSuppressTrailingZeros Overload
Autodesk.Revit.DB Namespace